{"LanguageCode":"en","Id":"thubaity-1","Name":"Abdul Bari Ath Thobaity","ImagePath":"images/reciters/thubaity-1.png","BioText":"<p>Sheikh Abdul Bari Bin Awad Al Thobaity was born in Mecca, Saudi Arabia in 1380 / 1960. His life is marked by numerous achievements in the field of Daa'wa (Islamic outreach) and voluntary work, including significant roles such as being the Imam of Masjid Haram (the Holy Mosque of Mecca) for several years. Currently, he serves as the Imam of Masjid Al-Nabawi (Prophet Muhammad Mosque) in Medina since the year 1414 / 1994.</p>\r\n\r\n    <p>Sheikh Abdul Bari's childhood was extraordinary as he memorized the Quran perfectly at a young age. He began teaching Quran and leading Muslims in prayer (Salat) at the age of 9, alongside his basic education, which was remarkable.</p>\r\n\r\n    <p>During his university studies at the Faculty of Science in King Abdul Aziz University, Sheikh Abdul Bari was appointed as an Imam at one of the mosques and achieved first place in the international competition of the Holy Quran in Mecca at the age of 19.</p>\r\n\r\n    <p>Throughout his career, Sheikh Abdul Bari Al Thobaity has served in various schools and mosques, earning the honor of being Imam at both Masjid Haram and Masjid Al-Nabawi, the most sacred mosques for Muslims.</p>\r\n\r\n    <p>Sheikh Abdul Bari faced a challenge when his vocal cords were injured and his voice was affected by illness, leading him to temporarily stop his work as an Imam and Quran reciter for 4 years. However, he returned to his role at Masjid Al-Nabawi after recovering.</p>\r\n\r\n    <p>His career has also included holding important positions in scientific and Islamic organizations, and he has made significant contributions to social, charitable, and voluntary work in Saudi Arabia.</p>\r\n\r\n    <h2>Personal Information</h2>\r\n    <ul>\r\n        <li><strong>Full Name:</strong> Sheikh Abdul Bari Bin Awad Al Thobaity</li>\r\n        <li><strong>Birthplace:</strong> Mecca, Saudi Arabia</li>\r\n        <li><strong>Date of Birth:</strong> 1380 / 1960</li>\r\n    </ul>\r\n\r\n    <h2>Accomplishments</h2>\r\n    <ul>\r\n        <li>Memorized the Quran at a young age</li>\r\n        <li>Appointed Imam of Masjid Haram and Masjid Al-Nabawi</li>\r\n        <li>Won first place in the international Quran competition in Mecca at age 19</li>\r\n        <li>Contributed significantly to social, charitable, and voluntary work in Saudi Arabia</li>\r\n        <li>Overcame vocal cord injury to return to his role as Imam</li>\r\n    </ul>","RecitationStyle":null,"Qirat":null}